# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
# tap 'homebrew/php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
# brew 'zsh'
# brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
# brew 'bash'

# Install more recent versions of some OS X tools
brew 'grep'

# Install Binaries
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'hub'
brew 'python'
brew 'git-extras'
brew 'gradle'

# Development
# brew 'php70', args: ['with-debug', 'without-apache']
# brew 'mariadb'

# Apps
cask 'betterzip'
cask 'istat-menus'
# cask 'menumeters'
# cask 'google-chrome'
# cask 'google-drive'
# cask 'dropbox'
# cask 'evernote'
cask 'itsycal'
cask 'cheatsheet'
cask 'diffmerge'
mas '1password', id: 443987910
mas 'amphetamine', id: 937984704
mas 'pages', id:409201541
mas 'numbers', id:409203825
mas 'keynote', id:409183694
mas 'snailgit', id: 1099475282
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'wineskin-winery'
# cask 'goofy'
# cask 'little-snitch'
# cask 'malwarebytes-anti-malware'

cask 'sublime-text'
cask 'iterm2'
cask 'spectacle'
cask 'java'
cask 'android-sdk'
cask 'android-ndk'
cask 'android-studio'
# cask 'android-file-transfer'
# cask 'macdown'
# cask 'sourcetree'
# cask 'transmit'
# cask 'rescuetime'
# cask 'screenhero'

# cask 'mysqlworkbench'
# cask 'phpstorm'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
# cask 'font-sauce-code-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
